package DTO;
/* -- 학생
 * 학번
 * 학생명
 * 전화번호
 * 과목
 * 성적
 * 출석
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 학생관리

- 로그인정보
아이디
비번
구분  :  학생 / 교수 / 직원

-학생
이름 : 김학생
학교/학년 : 20200301 학번 1학년
생년월일 : 
휴대폰 번호 : 010-0000-0000
 -- 신청과목 :학생번호, 과목코드 국어 / 수학 / 영어 .. 
 -- 출석  : 교실 , 날짜 , 시간 , 학생


-교수
이름 : 김교수 등외 교수 연혁 등 정보
과목코드 : A001
과목 : 국어
수업일정 : 월수금
수업시간 : 9:00
교실 : 101

이름 : 국교수 등외 교수 연혁 등 정보
과목코드 : A001
과목 : 국어
수업일정 : 화목
수업시간 : 13:30
교실 : 102
정원

이름 : 영교수 등외 교수 연혁 등 정보
과목코드 : E001 셀렉트로 
과목 : 영어
수업일정 : 화목
수업시간 : 13:30
교실 : 105
정원



- 과목종류
	과목코드
	과목명

- 교실 정원
	교실명
	정원수




- 보강자료
교수 과목 신청학생에게만 보여짐


점수관리
통계처리
총점, 평균 석차, 전체석차

출석부
회원정보
스케줄
보강자료
진도처리

 * */
public class Student {
	private String studentId;
	private String studentName;
	private String studentPhone;
	
}
